BtmsGatewayStub/Services/Simulation/Examples/AlvsToCdsErrorNotification.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:oas="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
    <soap:Header>
        <oas:Security soap:role="system" soap:mustUnderstand="true">
            <oas:UsernameToken>
                <oas:Username>systemID=ALVSHMRCCDS,ou=gsi systems,o=defra</oas:Username>
                <oas:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText">password</oas:Password>
            </oas:UsernameToken>
        </oas:Security>
    </soap:Header>
    <soap:Body>
        <HMRCErrorNotification xmlns="http://hmrcerror.types.esb.ws.cara.defra.com">
            <ServiceHeader>
                <SourceSystem>ALVS</SourceSystem>
                <DestinationSystem>CDS</DestinationSystem>
                <CorrelationId>000</CorrelationId>
                <ServiceCallTimestamp>2023-05-26T10:11:48.629812</ServiceCallTimestamp>
            </ServiceHeader>
            <Header>
                <SourceCorrelationId>101</SourceCorrelationId>
                <EntryReference>23GB5RQJ3MLPIM6AR8</EntryReference>
                <EntryVersionNumber>1</EntryVersionNumber>
            </Header>
            <Error>
                <ErrorCode>ALVSVAL325</ErrorCode>
                <ErrorMessage>The Import Declaration was processed as a New Import Declaration. However the DUCR 3GB00-CDS-ALVST2R08 and no Part Number for Owning Department 100 (NB Code 100=HMRC. If any other code, please contact the ALVS support team at IBM) is already known to ALVS as a currently active DUCR / Part Number. Your service request with Correlation ID 238605 has been terminated.</ErrorMessage>
            </Error>
        </HMRCErrorNotification>
    </soap:Body>
</soap:Envelope>